Repository: tecprog16-2/FoF
Catalog: data/translations/tutorial_*.po
Languages: hr

source: Ah yes, I know. I'm amazing.
hr: Ah da, znam. Nevjerojatan sam.

source: Ah, that was cool.
hr: Ah, to je bilo cool.

source: Und hello everyone.
hr: Und zdravo svi.

source: My name is Jurgen
hr: Ja sam Jurgen

source: Und today I will show you
hr: Und danas pokazat ću vam

source: how to play this game.
hr: kako igrati ovu igru.

source: Check this sh*t!
hr: Poslušaj ovu brijačinu!

source: And now, pick up your keyboard
hr: A sad, uzmi svoju tipkovnicu

source: like this.
hr: ovako.

source: When I shred,
hr: Kada ja rasturam,

source: I use the whole keyboard.
hr: ja koristim cijelu tipkovnicu.

source: But since you SUCK,
hr: Ali budući da si PLJUGER,

source: You will only need
hr: Trebat će ti

source: These five frets,
hr: ove dvije tipke,

source: Und zie Pick button.
hr: und zie Trzalica.

source: However, zie most important
hr: Doduše, zie najvažnija

source: is the Escape button.
hr: je Escape tipka.

source: You will need it,
hr: Trebat će ti,

source: when you finally realize
hr: kad konačno shvatiš

source: that you SUCK.
hr: da si PLJUGER.

source: Bigtime.
hr: Na veliko.

source: To me, that is already obvious.
hr: Za mene, to je očigledno.

source: Ok, there comes your first note.
hr: Ok, dolazi prva nota.

source: You can already hold down the 1st fret
hr: Možeš već držati 1. tipku

source: BUT DON'T PICK IT YET!
hr: ALI NEMOJ JU ZATRZATI!

source: You missed it.
hr: Promašio si.

source: Ok, let's try it again.
hr: Ok, pokušajmo ponovo.

source: Ok, wait for it.
hr: Ok, čekaj.

source: Wait for it.
hr: Čekaj

source: No!
hr: Ne!

source: *Sigh*
hr: *Ah*

source: Now, hold down two frets.
hr: Sad, drži dvije tipke

source: Ah, you missed it!
hr: Ah, promašio si!

source: And now, try this super easy lick.
hr: A sad, isprobaj ovu super laganicu.

source: Und up to my tempo.
hr: Und na moj način.

source: Don't try this,
hr: Ne pokušavaj ovo,

source: or you'll just hurt yourself.
hr: ili ćeš se ozlijediti.

source: Ok, that was about
hr: U redu, to je bilo oko

source: four billion notes per second.
hr: četiri milijarde nota po sekundi.

source: If I play that any faster,
hr: Ako odsviram imalo brže,

source: your minds would just blow up.
hr: tvoje misli će eksplodirati.

source: Ok, that is it for now.
hr: Ok, to je sve zasada.

source: You can now go and sell
hr: Možeš sada otići i prodati

source: your keyboards on Ebay.
hr: tipkovnicu na Ebay.

source: Because you SUCK.
hr: Zato jer si PLJUGER.

source: And remember one thing.
hr: I zapamti jednu stvar.

source: I am your new god, little girls.
hr: Ja sam vaš novi bog, djevojke.
